background/system/MultipleLines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   csv;

setConfig
{
    type    uniform;
    axis    xyz;  // x, y, z, xyz
	nPoints	1000;
}

sets
(
    line1
    {
        $setConfig;
        start   (0 0 0.05);
		end     (2.35 0 0.05);
    }
	
	line2
    {
        $setConfig;
        start (0.4 1.2 0.05);
        end   (0.4 -1.2 0.05);
    }
	
	line3
    {
        $setConfig;
        start (0.8 1.2 0.05);
        end   (0.8 -1.2 0.05);
    }
);

fields  (U p UMean pMean UPrime2Mean);

// ************************************************************************* //